__author__ = 'Иванов Станислав Борисович'

EASY

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

num =43558976298346

num = str(num)
count = 0
i = 0
while count < len(num):
    print(num[i])
    count += 1
    i += 1


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

a = input("Введите первое значение: ")

b = input("Введите  второе значение: ")

c = a

a = b

b = c

print(a, b)


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

a = int(input("Введите ваш возраст: "))

if a <= 18:
    print("Извините, пользование данным ресурсом только с 18 лет")
else: print("Доступ разрешен")



NORMAL

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

x = 3470972349607947
x = str(x)
num = 0
for i in x:
    i = int(i)
    if num < i:
        num = i
print(num)


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

a = input("Введите первое значение: ")
b = input("Введите второе значение: ")

a, b = b, a

print(a, b)


# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax? + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

import math

a = int(input("Введите первое значение: "))
b = int(input("Введите второе значение: "))
c = int(input("Введите третье значение: "))

D = b**2 - 4* a * c

x1 = (-b - D**0.5) / (2 * a)

x2 = (-b + D**0.5) / (2 * a)

print(x1,x2)


# не использовал sqrt(), потому что пишет ошибку ValueError: math domain error


